import ClickerNavbar from "./clickerNavbar";

function ClickerAccount() {
  return (
    <div className="clicker">
      <div className="clicker-container">
        <h1>Профиль</h1>
        <h2>Статистика</h2>
        <div className="clicker-statistic">
          <div className="clicker-component">
            <p className="clicker-statistic__title">Набранные голоса</p>
            <p className="clicker-statistic__text">50000</p>
          </div>
          <div className="clicker-component">
            <p className="clicker-statistic__title">Уровень</p>
            <p className="clicker-statistic__text">1</p>
          </div>
        </div>
        <div className="clicker-component">
          <p className="clicker-statistic__title">
            Количество приглашенных друзей
          </p>
          <p className="clicker-statistic__text">0</p>
        </div>
        <h2>Выполненные задания</h2>
        <div className="cliker-tasks">
          <div className="cliker-tasks__item clicker-component">
            <div className="cliker-tasks__item-icon">
              <svg
                width="52"
                height="51"
                viewBox="0 0 52 51"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <rect x="6" y="9" width="40" height="34" fill="white" />
                <path
                  d="M20.5595 0.00637527L22.139 0H29.861L31.4427 0.00637527L33.423 0.0276262L34.3612 0.0425018L35.2668 0.0658777L36.14 0.095629L36.9807 0.12963L37.791 0.174257L38.571 0.227384L39.3185 0.291137L40.04 0.361265C43.81 0.777782 46.3948 1.67032 48.3448 3.5829C50.2948 5.49548 51.2048 8.02858 51.6295 11.7284L51.7032 12.436L51.766 13.1713L51.8202 13.9363L51.8635 14.729L51.9177 15.9785L51.9437 16.8498L51.9718 18.2184L51.9913 20.1628L52 22.2454L51.9978 29.2858L51.9913 30.8372L51.9697 32.7795L51.9545 33.6997L51.9307 34.5879L51.9003 35.4444L51.8657 36.2689L51.8202 37.0637L51.766 37.8287L51.701 38.5619L51.6295 39.2695C51.2048 42.9672 50.2948 45.5024 48.3448 47.415C46.3948 49.3276 43.8122 50.2201 40.04 50.6366L39.3185 50.7089L38.5688 50.7705L37.7888 50.8236L36.9807 50.8661L35.7067 50.9192L34.8183 50.9447L33.423 50.9724L31.4405 50.9915L29.3172 51L22.139 50.9979L20.5573 50.9915L18.577 50.9702L17.6388 50.9554L16.7332 50.932L15.86 50.9022L15.0193 50.8682L14.209 50.8236L13.429 50.7705L12.6815 50.7067L11.96 50.6366C8.19 50.2201 5.60517 49.3276 3.65517 47.415C1.70517 45.5024 0.795167 42.9693 0.3705 39.2695L0.296833 38.5619L0.234 37.8266L0.179833 37.0615L0.1365 36.2689L0.0823333 35.0193L0.0563333 34.148L0.0281667 32.7795L0.00866667 30.835L0 28.7524L0.00216667 21.712L0.00866667 20.1607L0.0303333 18.2184L0.0455 17.2982L0.0693333 16.4099L0.0996667 15.5535L0.134333 14.729L0.179833 13.9342L0.234 13.1692L0.299 12.436L0.3705 11.7284C0.795167 8.03071 1.70517 5.49548 3.65517 3.5829C5.60517 1.67032 8.18783 0.777782 11.96 0.361265L12.6815 0.289012L13.4312 0.227384L14.2112 0.174257L15.0193 0.131755L16.2933 0.0786283L17.1817 0.0531272L18.577 0.0255011L20.5595 0.00637527ZM14.7117 15.511H8.775C9.05667 28.7716 15.8167 36.7407 27.6683 36.7407H28.34V29.1541C32.695 29.5791 35.9883 32.703 37.31 36.7407H43.4633C41.7733 30.7054 37.3317 27.369 34.5583 26.094C37.3317 24.5214 41.2317 20.6962 42.1633 15.511H36.5733C35.36 19.7187 31.7633 23.5439 28.34 23.9051V15.511H22.75V30.2166C19.2833 29.3666 14.9067 25.2439 14.7117 15.511Z"
                  fill="#0077FF"
                />
              </svg>
            </div>
            <div className="cliker-tasks__item-text">
              <h3>Посмотри видео</h3>
              <p>+100 голосов</p>
            </div>
          </div>
          <div className="cliker-tasks__item clicker-component">
            <div className="cliker-tasks__item-icon">
              <svg
                width="51"
                height="51"
                viewBox="0 0 51 51"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <g clipPath="url(#clip0_60_96)">
                  <path
                    d="M25.5 0C18.7385 0 12.248 2.68826 7.4707 7.46871C2.68854 12.2511 0.00136843 18.7369 0 25.5C0 32.2603 2.68945 38.7508 7.4707 43.5313C12.248 48.3117 18.7385 51 25.5 51C32.2615 51 38.752 48.3117 43.5293 43.5313C48.3105 38.7508 51 32.2603 51 25.5C51 18.7397 48.3105 12.2492 43.5293 7.46871C38.752 2.68826 32.2615 0 25.5 0Z"
                    fill="url(#paint0_linear_60_96)"
                  />
                  <path
                    d="M11.5427 25.2307C18.9776 21.9922 23.9341 19.8571 26.4124 18.8254C33.4966 15.8798 34.9669 15.3682 35.9271 15.3509C36.1383 15.3475 36.6084 15.3997 36.9152 15.6477C37.1702 15.8569 37.2419 16.1398 37.2778 16.3384C37.3097 16.5368 37.3535 16.989 37.3177 17.3421C36.9352 21.3742 35.2737 31.1591 34.429 35.6754C34.0744 37.5863 33.3691 38.2269 32.6878 38.2895C31.2056 38.4258 30.082 37.3109 28.6477 36.371C26.4044 34.8996 25.1374 33.984 22.958 32.5484C20.4398 30.8893 22.0734 29.9773 23.5078 28.4871C23.8823 28.0971 30.4087 22.1623 30.5323 21.6241C30.5482 21.5567 30.5641 21.3057 30.4127 21.1734C30.2653 21.0407 30.0462 21.0862 29.8868 21.122C29.6597 21.173 26.0777 23.5429 19.129 28.2313C18.113 28.9302 17.1926 29.2709 16.3638 29.2529C15.4554 29.2334 13.7023 28.7382 12.3994 28.315C10.8056 27.7959 9.5346 27.5213 9.64617 26.6396C9.70195 26.1806 10.3355 25.7108 11.5427 25.2307Z"
                    fill="white"
                  />
                </g>
                <defs>
                  <linearGradient
                    id="paint0_linear_60_96"
                    x1="2550"
                    y1="0"
                    x2="2550"
                    y2="5100"
                    gradientUnits="userSpaceOnUse"
                  >
                    <stop stopColor="#2AABEE" />
                    <stop offset="1" stopColor="#229ED9" />
                  </linearGradient>
                  <clipPath id="clip0_60_96">
                    <rect width="51" height="51" fill="white" />
                  </clipPath>
                </defs>
              </svg>
            </div>
            <div className="cliker-tasks__item-text">
              <h3>Подпишись на канал</h3>
              <p>+100 голосов</p>
            </div>
          </div>
        </div>
        <button className="clicker-profile__button">
          Связаться с разработчиком
        </button>
        <ClickerNavbar></ClickerNavbar>
      </div>
    </div>
  );
}

export default ClickerAccount;
